package by.it1.decisions_9h37m53s.lesson02_34m53s;
/*
напишите программу которая выводит на экран
Hello world!

(строка должа быть одна, ошибки в тексте не допускаются)
Для ручной проверки запустите программу Ctrl+Shift+F10
Для автоматической проверки откройте и запустите класс Testing
*/

class TaskA1 {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
