package by.it.medvedev.lesson05;
/*
Создайте 5 различных строк в списке ArrayList:

1. Создайте список строк.
2. Добавьте в него 5 различных строк.
3. Выведите его размер на экран.
4. Используя цикл выведите его содержимое на экран, каждое значение с новой строки.

*/


import java.util.ArrayList;
import java.util.Scanner;

public class TaskB1 {
    public static void main(String[] args) {
        ArrayList<String> list = new ArrayList<>();
        while (true) {

            String one = "первая строка";
            String two = "вторая строка";
            String three = "третья строка";
            String four = "четвертая строка";
            String five = "пятая строка";
            break;

        }
        System.out.println(list);
    }
}

